import random

menu = {
    "обед/ужин": {
        "ризотто": ["грибы", "лук", "рис","морковь"],
        "овощной плов": ["морковь", "лук", "рис","перец", "соевое мясо"],
        "суши": ["листы нори", "рис", " огурец", "помидор", "авокадо", "перец", "тофу", "творожный сыр"],
        "summer_roll": ["рисовая бумага", "морковь", "авокадо", "тофу", "огурец", "перец"],
        "паста с броколли": ["паста", "броколли", "сливки", "морковь", "перец", "лук", "сыр", "зелень"],
        "капустный тушеная": ["капуста", "морковь", "лук", "перец"],
        "овощной суп": ["картофель", "морковь", "лук", "помидор", "вермишель"],
        "грибной суп ": ["грибы", "лук", "картофель", "морковь", "помидор", "сливки"],
        "чечевичный крем-суп": ["чечевица", "лук", "картофель", "морковь", "помидор"],
        "тыквенный крем-суп": ["тыква", "лук", "картофель", "морковь", "помидор", "кокосовые сливки"],
    },

        # "": [],

    "выпечка": {
        "фруктовый салат": ["яблоко", "ананас", "киви"],
        "шоколадный пудинг": ["шоколад", "сахар", "молоко"],
        "ягодный тарт": ["печенье", "ягоды", "сметана"],
        "хлеб из зеленой гречки": ["зеленая гречка", "псилиум", "кунжут", "семена льна", "конопляная мука",
                                   "подсолничные семечки", "семена чиа", "коноплянное масло", ""],
    },
    "салат": {
        "греческий": ["помидоры", "огурцы", "сливочный сыр"],
        "цезарь": ["салат", "курица", "пармезан"],
        "морковный": ["морковь", "яблоко", "орехи"]
    },
    "соус": {
        "томатный": ["томаты", "лук", "специи"],
        "сырный": ["сыр", "молоко", "мука"],
        "грибной": ["грибы", "лук", "сливки"]
        # "": [],
        # "": [],
        # "": [],
    },
    "завтраки": {
        "веганский бургер": ["батон", "фасоль", "овощи"],
        "лапша с овощами": ["овощи", "лапша", "специи"],
        "тофу со сладким перцем": ["тофу", "перец", "масло"]
    },
    "алиса": {
        "шоты": ["лимон 2шт", "имбирь", "апельсин 2 шт", "мед"],
        "зеленый сок": ["зеленое яблоко", "селдерей", "лайм"],
        "тепаче": ["ананас", "корица", "кардамон", "кориандр"]
    }
}
def generate_menu():
    selected_dishes = {}

    for category in menu.keys():
        vegetarian_dishes = menu[category]
        random_dish = random.choice(list(vegetarian_dishes.keys()))
        selected_dishes[category] = {
            "блюдо": random_dish,
            "ингредиенты": vegetarian_dishes[random_dish]
        }

    with open('menu.txt', 'w', encoding='utf-8') as f:
        for category in selected_dishes.keys():
            f.write(category.upper() + '\n')
            f.write('-' * 20 + '\n')
            f.write("Блюдо: " + selected_dishes[category]["блюдо"] + '\n')
            f.write("Ингредиенты: \n")
            for ingredient in selected_dishes[category]["ингредиенты"]:
                f.write("- " + ingredient + '\n')
            f.write('\n')

    print("Выбранные блюда:")
    for category in selected_dishes.keys():
        print(category.upper())
        print('-' * 20)
        print("Блюдо: " + selected_dishes[category]["блюдо"])
        print("Ингредиенты:")
        for ingredient in selected_dishes[category]["ингредиенты"]:
            print("- " + ingredient)
        print()


generate_menu()
